
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |    Change |   🔴 Destroy |
|----------:|---------:|----------:|-------------:|
|        ✅ |       38 |         0 |            2 |
## Affected resources by action

|  Action  | Resources                                                                                                     |
|:--------:|:--------------------------------------------------------------------------------------------------------------|
|    🟢    | `module.actions-runner.aws_autoscaling_lifecycle_hook.terminating`                                            |
|    🟢    | `module.actions-runner.aws_autoscaling_policy.scale_in`                                                       |
|    🟢    | `module.actions-runner.aws_autoscaling_policy.scale_out`                                                      |
|    🟢    | `module.actions-runner.aws_cloudwatch_metric_alarm.idle_runners_high`                                         |
|    🟢    | `module.actions-runner.aws_cloudwatch_metric_alarm.idle_runners_low`                                          |
|    🟢    | `module.actions-runner-noble.aws_autoscaling_lifecycle_hook.terminating`                                      |
|    🟢    | `module.actions-runner-noble.aws_autoscaling_policy.scale_in`                                                 |
|    🟢    | `module.actions-runner-noble.aws_autoscaling_policy.scale_out`                                                |
|    🟢    | `module.actions-runner-noble.aws_cloudwatch_metric_alarm.idle_runners_high`                                   |
|    🟢    | `module.actions-runner-noble.aws_cloudwatch_metric_alarm.idle_runners_low`                                    |
|    🟢    | `module.actions-runner.module.record_metric.aws_cloudwatch_event_rule.run_every`                              |
|    🟢    | `module.actions-runner.module.record_metric.aws_cloudwatch_event_target.lambda_target`                        |
|    🟢    | `module.actions-runner.module.record_metric.aws_cloudwatch_log_group.lambda`                                  |
|    🟢    | `module.actions-runner.module.record_metric.aws_iam_policy.lambda_logging`                                    |
|    🟢    | `module.actions-runner.module.record_metric.aws_iam_policy.lambda_permissions`                                |
|    🟢    | `module.actions-runner.module.record_metric.aws_iam_role.iam_for_lambda`                                      |
|    🟢    | `module.actions-runner.module.record_metric.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole`       |
|    🟢    | `module.actions-runner.module.record_metric.aws_iam_role_policy_attachment.lambda_logs`                       |
|    🟢    | `module.actions-runner.module.record_metric.aws_iam_role_policy_attachment.lambda_permissions`                |
|    🟢    | `module.actions-runner.module.record_metric.aws_lambda_function.lambda`                                       |
|    🟢    | `module.actions-runner.module.record_metric.aws_lambda_function_event_invoke_config.update_filter`            |
|    🟢    | `module.actions-runner.module.record_metric.aws_lambda_permission.allow_eventbridge`                          |
|    🟢    | `module.actions-runner.module.record_metric.aws_s3_object.lambda_package`                                     |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_cloudwatch_event_rule.run_every`                        |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_cloudwatch_event_target.lambda_target`                  |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_cloudwatch_log_group.lambda`                            |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_iam_policy.lambda_logging`                              |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_iam_policy.lambda_permissions`                          |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_iam_role.iam_for_lambda`                                |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole` |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_iam_role_policy_attachment.lambda_logs`                 |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_iam_role_policy_attachment.lambda_permissions`          |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_lambda_function.lambda`                                 |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_lambda_function_event_invoke_config.update_filter`      |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_lambda_permission.allow_eventbridge`                    |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_s3_object.lambda_package`                               |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.actions-runner.aws_autoscaling_group.actions-runner is tainted, so must be replaced
-/+ resource "aws_autoscaling_group" "actions-runner" {
      ~ arn                              = "arn:aws:autoscaling:us-west-1:303467602807:autoScalingGroup:47070d64-fad8-43c5-b7a4-653313229af6:autoScalingGroupName/actions-runner-20250505203133108100000007-INx3ry" -> (known after apply)
      ~ availability_zones               = [
          - "us-west-1b",
          - "us-west-1c",
        ] -> (known after apply)
      - capacity_rebalance               = false -> null
      ~ default_cooldown                 = 300 -> (known after apply)
      - default_instance_warmup          = 0 -> null
      ~ desired_capacity                 = 1 -> (known after apply)
      - enabled_metrics                  = [] -> null
      ~ health_check_type                = "EC2" -> (known after apply)
      ~ id                               = "actions-runner-20250505203133108100000007-INx3ry" -> (known after apply)
      ~ load_balancers                   = [] -> (known after apply)
        name                             = "actions-runner-20250505203133108100000007-INx3ry"
      + name_prefix                      = (known after apply)
      ~ predicted_capacity               = 0 -> (known after apply)
      ~ service_linked_role_arn          = "arn:aws:iam::303467602807:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - suspended_processes              = [] -> null
      ~ target_group_arns                = [] -> (known after apply)
      - termination_policies             = [] -> null
      ~ warm_pool_size                   = 0 -> (known after apply)
        # (15 unchanged attributes hidden)

      ~ availability_zone_distribution (known after apply)
      - availability_zone_distribution {
          - capacity_distribution_strategy = "balanced-best-effort" -> null
        }

      ~ instance_refresh {
          - triggers = [] -> null
            # (1 unchanged attribute hidden)

          ~ preferences {
              - auto_rollback                = false -> null
              - checkpoint_percentages       = [] -> null
                # (7 unchanged attributes hidden)
            }
        }

      + launch_template {
          + id      = "lt-08b47595a3bdafaf1"
          + name    = (known after apply)
          + version = "1"
        }

      ~ mixed_instances_policy (known after apply)
      - mixed_instances_policy {
          - instances_distribution {
              - on_demand_allocation_strategy            = "prioritized" -> null
              - on_demand_base_capacity                  = 0 -> null
              - on_demand_percentage_above_base_capacity = 0 -> null
              - spot_allocation_strategy                 = "lowest-price" -> null
              - spot_instance_pools                      = 2 -> null
                # (1 unchanged attribute hidden)
            }
          - launch_template {
              - launch_template_specification {
                  - launch_template_id   = "lt-08b47595a3bdafaf1" -> null
                  - launch_template_name = "actions-runner-20250505203133108100000007" -> null
                  - version              = "1" -> null
                }
            }
        }

      ~ traffic_source (known after apply)

      + warm_pool {
          + max_group_prepared_capacity = 2
          + min_size                    = 2
          + pool_state                  = "Hibernated"

          + instance_reuse_policy {
              + reuse_on_scale_in = true
            }
        }

        # (9 unchanged blocks hidden)
    }

  # module.actions-runner.aws_autoscaling_lifecycle_hook.terminating will be created
  + resource "aws_autoscaling_lifecycle_hook" "terminating" {
      + autoscaling_group_name = "actions-runner-20250505203133108100000007-INx3ry"
      + default_result         = "ABANDON"
      + heartbeat_timeout      = 3600
      + id                     = (known after apply)
      + lifecycle_transition   = "autoscaling:EC2_INSTANCE_TERMINATING"
      + name                   = "deregistration"
    }

  # module.actions-runner.aws_autoscaling_policy.scale_in will be created
  + resource "aws_autoscaling_policy" "scale_in" {
      + adjustment_type         = "ChangeInCapacity"
      + arn                     = (known after apply)
      + autoscaling_group_name  = "actions-runner-20250505203133108100000007-INx3ry"
      + cooldown                = 180
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "scale-in-idle-runners"
      + policy_type             = "SimpleScaling"
      + scaling_adjustment      = -1
    }

  # module.actions-runner.aws_autoscaling_policy.scale_out will be created
  + resource "aws_autoscaling_policy" "scale_out" {
      + adjustment_type         = "ChangeInCapacity"
      + arn                     = (known after apply)
      + autoscaling_group_name  = "actions-runner-20250505203133108100000007-INx3ry"
      + cooldown                = 180
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "scale-out-idle-runners"
      + policy_type             = "SimpleScaling"
      + scaling_adjustment      = 1
    }

  # module.actions-runner.aws_cloudwatch_metric_alarm.idle_runners_high will be created
  + resource "aws_cloudwatch_metric_alarm" "idle_runners_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Too many idle runners"
      + alarm_name                            = "IdleRunnersTooHigh-actions-runner-20250505203133108100000007-INx3ry"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "asg_name" = "actions-runner-20250505203133108100000007-INx3ry"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 3
      + id                                    = (known after apply)
      + metric_name                           = "IdleRunners"
      + namespace                             = "GitHubRunners"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.actions-runner.aws_cloudwatch_metric_alarm.idle_runners_low will be created
  + resource "aws_cloudwatch_metric_alarm" "idle_runners_low" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Idle runners below safe threshold"
      + alarm_name                            = "IdleRunnersTooLow-actions-runner-20250505203133108100000007-INx3ry"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "asg_name" = "actions-runner-20250505203133108100000007-INx3ry"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "IdleRunners"
      + namespace                             = "GitHubRunners"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.actions-runner-noble.aws_autoscaling_group.actions-runner is tainted, so must be replaced
-/+ resource "aws_autoscaling_group" "actions-runner" {
      ~ arn                              = "arn:aws:autoscaling:us-west-1:303467602807:autoScalingGroup:72f58545-bef0-4fcf-824b-86e287141468:autoScalingGroupName/actions-runner-20250505203133193000000009-KWX4No" -> (known after apply)
      ~ availability_zones               = [
          - "us-west-1b",
          - "us-west-1c",
        ] -> (known after apply)
      - capacity_rebalance               = false -> null
      ~ default_cooldown                 = 300 -> (known after apply)
      - default_instance_warmup          = 0 -> null
      ~ desired_capacity                 = 1 -> (known after apply)
      - enabled_metrics                  = [] -> null
      ~ health_check_type                = "EC2" -> (known after apply)
      ~ id                               = "actions-runner-20250505203133193000000009-KWX4No" -> (known after apply)
      ~ load_balancers                   = [] -> (known after apply)
        name                             = "actions-runner-20250505203133193000000009-KWX4No"
      + name_prefix                      = (known after apply)
      ~ predicted_capacity               = 0 -> (known after apply)
      ~ service_linked_role_arn          = "arn:aws:iam::303467602807:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - suspended_processes              = [] -> null
      ~ target_group_arns                = [] -> (known after apply)
      - termination_policies             = [] -> null
      ~ warm_pool_size                   = 0 -> (known after apply)
        # (15 unchanged attributes hidden)

      ~ availability_zone_distribution (known after apply)
      - availability_zone_distribution {
          - capacity_distribution_strategy = "balanced-best-effort" -> null
        }

      ~ instance_refresh {
          - triggers = [] -> null
            # (1 unchanged attribute hidden)

          ~ preferences {
              - auto_rollback                = false -> null
              - checkpoint_percentages       = [] -> null
                # (7 unchanged attributes hidden)
            }
        }

      + launch_template {
          + id      = "lt-0fe52afb929ab485f"
          + name    = (known after apply)
          + version = "1"
        }

      ~ mixed_instances_policy (known after apply)
      - mixed_instances_policy {
          - instances_distribution {
              - on_demand_allocation_strategy            = "prioritized" -> null
              - on_demand_base_capacity                  = 0 -> null
              - on_demand_percentage_above_base_capacity = 0 -> null
              - spot_allocation_strategy                 = "lowest-price" -> null
              - spot_instance_pools                      = 2 -> null
                # (1 unchanged attribute hidden)
            }
          - launch_template {
              - launch_template_specification {
                  - launch_template_id   = "lt-0fe52afb929ab485f" -> null
                  - launch_template_name = "actions-runner-20250505203133193000000009" -> null
                  - version              = "1" -> null
                }
            }
        }

      ~ traffic_source (known after apply)

      + warm_pool {
          + max_group_prepared_capacity = 2
          + min_size                    = 2
          + pool_state                  = "Hibernated"

          + instance_reuse_policy {
              + reuse_on_scale_in = true
            }
        }

        # (9 unchanged blocks hidden)
    }

  # module.actions-runner-noble.aws_autoscaling_lifecycle_hook.terminating will be created
  + resource "aws_autoscaling_lifecycle_hook" "terminating" {
      + autoscaling_group_name = "actions-runner-20250505203133193000000009-KWX4No"
      + default_result         = "ABANDON"
      + heartbeat_timeout      = 3600
      + id                     = (known after apply)
      + lifecycle_transition   = "autoscaling:EC2_INSTANCE_TERMINATING"
      + name                   = "deregistration"
    }

  # module.actions-runner-noble.aws_autoscaling_policy.scale_in will be created
  + resource "aws_autoscaling_policy" "scale_in" {
      + adjustment_type         = "ChangeInCapacity"
      + arn                     = (known after apply)
      + autoscaling_group_name  = "actions-runner-20250505203133193000000009-KWX4No"
      + cooldown                = 180
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "scale-in-idle-runners"
      + policy_type             = "SimpleScaling"
      + scaling_adjustment      = -1
    }

  # module.actions-runner-noble.aws_autoscaling_policy.scale_out will be created
  + resource "aws_autoscaling_policy" "scale_out" {
      + adjustment_type         = "ChangeInCapacity"
      + arn                     = (known after apply)
      + autoscaling_group_name  = "actions-runner-20250505203133193000000009-KWX4No"
      + cooldown                = 180
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "scale-out-idle-runners"
      + policy_type             = "SimpleScaling"
      + scaling_adjustment      = 1
    }

  # module.actions-runner-noble.aws_cloudwatch_metric_alarm.idle_runners_high will be created
  + resource "aws_cloudwatch_metric_alarm" "idle_runners_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Too many idle runners"
      + alarm_name                            = "IdleRunnersTooHigh-actions-runner-20250505203133193000000009-KWX4No"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "asg_name" = "actions-runner-20250505203133193000000009-KWX4No"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 3
      + id                                    = (known after apply)
      + metric_name                           = "IdleRunners"
      + namespace                             = "GitHubRunners"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.actions-runner-noble.aws_cloudwatch_metric_alarm.idle_runners_low will be created
  + resource "aws_cloudwatch_metric_alarm" "idle_runners_low" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Idle runners below safe threshold"
      + alarm_name                            = "IdleRunnersTooLow-actions-runner-20250505203133193000000009-KWX4No"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "asg_name" = "actions-runner-20250505203133193000000009-KWX4No"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "IdleRunners"
      + namespace                             = "GitHubRunners"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.actions-runner.module.record_metric.data.aws_iam_policy_document.lambda_logging will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_logging" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:us-west-1:303467602807:log-group:*:log-stream:*",
            ]
        }
    }

  # module.actions-runner.module.record_metric.aws_cloudwatch_event_rule.run_every will be created
  + resource "aws_cloudwatch_event_rule" "run_every" {
      + arn                 = (known after apply)
      + description         = "Trigger Lambda record_metric_actions-runner-20250505203133108100000007-INx3ry every minute"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = (known after apply)
      + name_prefix         = "actions-runner-20250505203133108100000"
      + schedule_expression = "rate(1 minute)"
      + tags                = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all            = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner.module.record_metric.aws_cloudwatch_event_target.lambda_target will be created
  + resource "aws_cloudwatch_event_target" "lambda_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = "send-to-lambda"
    }

  # module.actions-runner.module.record_metric.aws_cloudwatch_log_group.lambda will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/record_metric_actions-runner-20250505203133108100000007-INx3ry"
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all          = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner.module.record_metric.aws_iam_policy.lambda_logging will be created
  + resource "aws_iam_policy" "lambda_logging" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for logging from a lambda record_metric_actions-runner-20250505203133108100000007-INx3ry"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda_logging"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all         = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner.module.record_metric.aws_iam_policy.lambda_permissions will be created
  + resource "aws_iam_policy" "lambda_permissions" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for a lambda permissions"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda_permissions"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:GetCallerIdentity"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "autoscaling:DescribeAutoScalingGroups"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = "cloudwatch:PutMetricData"
                      + Condition = {
                          + StringEquals = {
                              + "cloudwatch:namespace" = "GitHubRunners"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all         = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner.module.record_metric.aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "infrahouse-registration"
      + path                  = "/"
      + tags                  = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all              = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.actions-runner.module.record_metric.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaBasicExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # module.actions-runner.module.record_metric.aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.actions-runner.module.record_metric.aws_iam_role_policy_attachment.lambda_permissions will be created
  + resource "aws_iam_role_policy_attachment" "lambda_permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.actions-runner.module.record_metric.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "record_metric_actions-runner-20250505203133108100000007-INx3ry"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + s3_bucket                      = "infrahouse-action-runner-lambda-20250505203126570200000001"
      + s3_key                         = "ca8c4283-59ba-1241-a9f3-75d742145f48.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all                       = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ASG_NAME"           = "actions-runner-20250505203133108100000007-INx3ry"
              + "GH_APP_ID"          = "1016363"
              + "GITHUB_ORG_NAME"    = "infrahouse"
              + "GITHUB_SECRET"      = "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP"
              + "GITHUB_SECRET_TYPE" = "pem"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.actions-runner.module.record_metric.aws_lambda_function_event_invoke_config.update_filter will be created
  + resource "aws_lambda_function_event_invoke_config" "update_filter" {
      + function_name          = "record_metric_actions-runner-20250505203133108100000007-INx3ry"
      + id                     = (known after apply)
      + maximum_retry_attempts = 0
    }

  # module.actions-runner.module.record_metric.aws_lambda_permission.allow_eventbridge will be created
  + resource "aws_lambda_permission" "allow_eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "record_metric_actions-runner-20250505203133108100000007-INx3ry"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge"
      + statement_id_prefix = (known after apply)
    }

  # module.actions-runner.module.record_metric.aws_s3_object.lambda_package will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "infrahouse-action-runner-lambda-20250505203126570200000001"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "ca8c4283-59ba-1241-a9f3-75d742145f48.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = ".terraform/modules/actions-runner/modules/record_metric/ca8c4283-59ba-1241-a9f3-75d742145f48.zip"
      + storage_class          = (known after apply)
      + tags                   = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all               = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + version_id             = (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.data.aws_iam_policy_document.lambda_logging will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_logging" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:us-west-1:303467602807:log-group:*:log-stream:*",
            ]
        }
    }

  # module.actions-runner-noble.module.record_metric.aws_cloudwatch_event_rule.run_every will be created
  + resource "aws_cloudwatch_event_rule" "run_every" {
      + arn                 = (known after apply)
      + description         = "Trigger Lambda record_metric_actions-runner-20250505203133193000000009-KWX4No every minute"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = (known after apply)
      + name_prefix         = "actions-runner-20250505203133193000000"
      + schedule_expression = "rate(1 minute)"
      + tags                = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all            = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner-noble.module.record_metric.aws_cloudwatch_event_target.lambda_target will be created
  + resource "aws_cloudwatch_event_target" "lambda_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = "send-to-lambda"
    }

  # module.actions-runner-noble.module.record_metric.aws_cloudwatch_log_group.lambda will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/record_metric_actions-runner-20250505203133193000000009-KWX4No"
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all          = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner-noble.module.record_metric.aws_iam_policy.lambda_logging will be created
  + resource "aws_iam_policy" "lambda_logging" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for logging from a lambda record_metric_actions-runner-20250505203133193000000009-KWX4No"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda_logging"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all         = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner-noble.module.record_metric.aws_iam_policy.lambda_permissions will be created
  + resource "aws_iam_policy" "lambda_permissions" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for a lambda permissions"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda_permissions"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:GetCallerIdentity"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "autoscaling:DescribeAutoScalingGroups"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = "cloudwatch:PutMetricData"
                      + Condition = {
                          + StringEquals = {
                              + "cloudwatch:namespace" = "GitHubRunners"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all         = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner-noble.module.record_metric.aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "infrahouse-registration"
      + path                  = "/"
      + tags                  = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all              = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaBasicExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.aws_iam_role_policy_attachment.lambda_permissions will be created
  + resource "aws_iam_role_policy_attachment" "lambda_permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "record_metric_actions-runner-20250505203133193000000009-KWX4No"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + s3_bucket                      = "infrahouse-action-runner-lambda-20250505203126845000000003"
      + s3_key                         = "b5bc54d1-fc40-b559-fa72-99ee4b1b7ad0.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all                       = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ASG_NAME"           = "actions-runner-20250505203133193000000009-KWX4No"
              + "GH_APP_ID"          = "1016363"
              + "GITHUB_ORG_NAME"    = "infrahouse"
              + "GITHUB_SECRET"      = "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP"
              + "GITHUB_SECRET_TYPE" = "pem"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.aws_lambda_function_event_invoke_config.update_filter will be created
  + resource "aws_lambda_function_event_invoke_config" "update_filter" {
      + function_name          = "record_metric_actions-runner-20250505203133193000000009-KWX4No"
      + id                     = (known after apply)
      + maximum_retry_attempts = 0
    }

  # module.actions-runner-noble.module.record_metric.aws_lambda_permission.allow_eventbridge will be created
  + resource "aws_lambda_permission" "allow_eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "record_metric_actions-runner-20250505203133193000000009-KWX4No"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge"
      + statement_id_prefix = (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.aws_s3_object.lambda_package will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "infrahouse-action-runner-lambda-20250505203126845000000003"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "b5bc54d1-fc40-b559-fa72-99ee4b1b7ad0.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = ".terraform/modules/actions-runner-noble/modules/record_metric/b5bc54d1-fc40-b559-fa72-99ee4b1b7ad0.zip"
      + storage_class          = (known after apply)
      + tags                   = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all               = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + version_id             = (known after apply)
    }

Plan: 38 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDM4LCAiY2hhbmdlIjogMCwgImRlc3Ryb3kiOiAyfX0=
```
</details>